class ClosedTasksTexts:
    NOT_FOUND_CLOSED_TASKS_TEXT = (
        "📂 К сожалению, закрытых задач не найдено. "
        "Пожалуйста, попробуйте позже или обратитесь в поддержку. 🙏"
    )
    CLOSED_TASKS_TEXT = "📋 Закрытые задачи"
    OPEN_TASK_TEXT = "✅ Открыть заявку"
    MAIN_MENU_TEXT = "🏠 Главное меню"
    USER_OPEN_TASK = "📝 Пользователь запросил повторное открытие задачи."
    ERROR_OPEN_TASK_TEXT = (
        "❌ Не удалось открыть задачу. "
        "Пожалуйста, проверьте данные и попробуйте снова, или обратитесь в поддержку. ℹ️"
    )
    SUCCESS_OPEN_TASK = (
        "✅ Задача успешно открыта! "
        "Спасибо за терпение. Если у вас есть дополнительные вопросы, дайте знать. 😊"
    )